# 3. Задайте список из n чисел последовательности (1+1/n)**n и выведите на экран их сумму.
# Пример:
# - Для n=4 [2, 2.25, 2.37, 2.44]
# Сумма 9.06

n = 7
f_array = []
i = 1

while i <= n:
    f_array.append((1+1/i)**i)
    i += 1

sum = 0
for i in range (0, len(f_array)):
    sum = sum + f_array[i]

print('Сумма элементов массива равна:', round(sum, 2))